The database used in this lab is an internal database. You will be working on a sample HR database. This HR database schema consists of 5 tables called EMPLOYEES, JOB_HISTORY, JOBS, DEPARTMENTS and LOCATIONS. Each table has a few rows of sample data. The following diagram shows the tables for the HR database:

In [18]:
import mysql.connector

In [26]:
mydb = mysql.connector.connect(host = 'localhost', user='root',password='@Abimbola1', database='HR_DATABASE')

In [28]:
mycursor = mydb.cursor()

In [29]:
mycursor.execute('CREATE TABLE EMPLOYEES(EMP_ID VARCHAR(5) NOT NULL, F_NAME VARCHAR(20), L_NAME VARCHAR(25), SSN INT, B_DATE VARCHAR(15), SEX CHAR(1), ADDRESS VARCHAR(50), JOB_ID INT, SALARY INT, MANAGER_ID INT, DEP_ID INT)')

In [30]:
mycursor.execute('SHOW COLUMNS FROM EMPLOYEES')
mycursor.fetchall()

[('EMP_ID', 'varchar(5)', 'NO', '', None, ''),
 ('F_NAME', 'varchar(20)', 'YES', '', None, ''),
 ('L_NAME', 'varchar(25)', 'YES', '', None, ''),
 ('SSN', 'int', 'YES', '', None, ''),
 ('B_DATE', 'varchar(15)', 'YES', '', None, ''),
 ('SEX', 'char(1)', 'YES', '', None, ''),
 ('ADDRESS', 'varchar(50)', 'YES', '', None, ''),
 ('JOB_ID', 'int', 'YES', '', None, ''),
 ('SALARY', 'int', 'YES', '', None, ''),
 ('MANAGER_ID', 'int', 'YES', '', None, ''),
 ('DEP_ID', 'int', 'YES', '', None, '')]

In [31]:
column = 'INSERT INTO EMPLOYEES VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'
row = [('E1001', 'John', 'Thomas', '123456', '1976-01-09', 'M','5631 Rice, OakPark,IL', '100','100000','30001','2'),
      ('E1002', 'Alice' ,'James', '123457', '1972-07-31', 'F', '980 Berry In, Elgin,IL', '200', '80000', '30002', '5'),
      ('E1003', 'Steve', 'Wells', '123458', '1980-08-10', 'M', '291 Springs, Gary, IL', '300', '50000', '30002', '5')]

mycursor.executemany(column,row)

In [32]:
mycursor.execute('CREATE TABLE JOB_HISTORY(EMPL_ID VARCHAR(5), START_DATE VARCHAR(15), JOBS_ID INT, DEPT_ID INT)')

In [33]:
column = 'INSERT INTO JOB_HISTORY VALUES(%s, %s, %s, %s)'
row = [('E1001', '2000-01-30', '100', '2'),
      ('E1002', '2010-08-16','200','5'),
      ('E1003', '2016-08-10', '300','5')]

mycursor.executemany(column,row)

In [34]:
mycursor.execute('CREATE TABLE JOBS(JOB_IDENT INT, JOB_TITLE VARCHAR(255), MIN_SALARY INT, MAX_SALARY INT)')

In [35]:
column = 'INSERT INTO JOBS VALUES(%s, %s, %s, %s)'
row = [('100', 'Sr. Architect', '60000', '100000'),
      ('200', 'Sr.SoftwareDeveloper', '60000', '80000'),
      ('300', 'Jr.SoftwareDeveloper', '40000', '60000')]
mycursor.executemany(column, row)

In [36]:
mycursor.execute('CREATE TABLE DEPARTMENTS(DEPT_ID_DEP INT, DEP_NAME VARCHAR(255), MANAGER_ID INT, LOC_ID VARCHAR(7))')

In [37]:
column = 'INSERT INTO DEPARTMENTS VALUES(%s, %s, %s, %s)'
row = [('2', 'Architect Group', '30001', 'L0001'),
      ('5', 'Software Development', '30002', 'L0002'),
      ('7', 'Design Team','30003', 'L0003')]
mycursor.executemany(column, row)

In [38]:
mycursor.execute('CREATE TABLE LOCATIONS(LOCT_ID VARCHAR(7), DEP_ID_LOC INT)')

In [39]:
column = 'INSERT INTO LOCATIONS VALUES(%s,%s)'
row = [('L0001', '2'),
      ('L0002', '5'),
      ('L0003', '7')]
mycursor.executemany(column,row)

In [40]:
mycursor.execute('SELECT F_NAME, L_NAME FROM EMPLOYEES')

In [41]:
mycursor.fetchall()

[('John', 'Thomas'), ('Alice', 'James'), ('Steve', 'Wells')]

Retrieve all employees whose address is in Elgin,IL.

In [42]:
mycursor.execute('SELECT * FROM EMPLOYEES WHERE ADDRESS LIKE "%Gary, IL%"')
mycursor.fetchall()

[('E1003',
  'Steve',
  'Wells',
  123458,
  '1980-08-10',
  'M',
  '291 Springs, Gary, IL',
  300,
  50000,
  30002,
  5)]

In [44]:
mycursor.execute('SELECT F_NAME, L_NAME FROM EMPLOYEES WHERE B_DATE LIKE "197%"')

In [45]:
mycursor.fetchall()

[('John', 'Thomas'), ('Alice', 'James')]

In [46]:
mycursor.execute('SHOW TABLES FROM HR_DATABASE')

In [47]:
mycursor.fetchall()

[('DEPARTMENTS',), ('EMPLOYEES',), ('JOB_HISTORY',), ('JOBS',), ('LOCATIONS',)]

In [48]:
mycursor.execute('SHOW COLUMNS FROM EMPLOYEES')
mycursor.fetchall()

[('EMP_ID', 'varchar(5)', 'NO', '', None, ''),
 ('F_NAME', 'varchar(20)', 'YES', '', None, ''),
 ('L_NAME', 'varchar(25)', 'YES', '', None, ''),
 ('SSN', 'int', 'YES', '', None, ''),
 ('B_DATE', 'varchar(15)', 'YES', '', None, ''),
 ('SEX', 'char(1)', 'YES', '', None, ''),
 ('ADDRESS', 'varchar(50)', 'YES', '', None, ''),
 ('JOB_ID', 'int', 'YES', '', None, ''),
 ('SALARY', 'int', 'YES', '', None, ''),
 ('MANAGER_ID', 'int', 'YES', '', None, ''),
 ('DEP_ID', 'int', 'YES', '', None, '')]

In this lab, you will run through some SQL practice problems that will provide hands-on experience with nested SQL SELECT statements (also known as Sub-queries).

SELECT column_name [, column_name ]
FROM table1 [, table2 ]
WHERE column_name OPERATOR
   (SELECT column_name [, column_name ]
   FROM table1 [, table2 ]
   WHERE condition);

In [51]:
mycursor.execute('SELECT EMP_ID, F_NAME, L_NAME, SALARY FROM EMPLOYEES WHERE SALARY < (SELECT AVG(SALARY) FROM EMPLOYEES)')
avgs = mycursor.fetchall()
for i in avgs:
    print(i)

('E1003', 'Steve', 'Wells', 50000)

In [54]:
mycursor.execute('SELECT EMP_ID, SALARY, (SELECT MAX(SALARY) FROM EMPLOYEES) AS MAX_SALARY FROM EMPLOYEES')
mycursor.fetchall()

[('E1001', 100000, 100000), ('E1002', 80000, 100000), ('E1003', 50000, 100000)]